app/controllers/articles_controller.rb

  def create

    img = params[:article][:img]
    if img
      img_path = img.original_filename;
      path = File.join(Rails.root,
        "app/assets/images",img_path)
      File.open(path, "wb") do |f|
        f.write(img.read)
      end
    else
      img_path = ''
    end

    parames = {
      "title" => article_params[:title],
      "text" => article_params[:text],
      "img_path": img_path
    };

    @article = Article.new(parames)


    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Ampliando limites"], ["created_at", 2017-05-30 19:28:43 UTC], ["updated_at", 2017-05-30 19:28:43 UTC]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "mark" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Ampliando limites"], ["mark", true], ["updated_at", 2017-05-31 00:16:48 UTC], ["id", 1]]