app/controllers/donations_controller.rb

INSERT INTO "donations" ("amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", #<BigDecimal:8d9d9a8,'0.1E1',9(18)>], ["user_id", 1], ["created_at", 2017-06-01 16:27:45 UTC], ["updated_at", 2017-06-01 16:27:45 UTC]]
---
  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save