app/controllers/emails_controller.rb

INSERT INTO "emails" ("subject", "message", "mark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subject", "Obrigado por lutar contra o analfabetismo"], ["message", "Obrigado"], ["mark", false], ["created_at", 2017-05-31 12:46:54 UTC], ["updated_at", 2017-05-31 12:46:54 UTC]]
---
  def create
    @email = Email.new(email_params)

    respond_to do |format|
      if @email.save

DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 1]]
---
  def destroy
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_email
      @email = Email.find(params[:id])