app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("nome", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "douglas"], ["email", "kinny.chanter@gmail.com"], ["created_at", 2017-05-31 13:43:46 UTC], ["updated_at", 2017-05-31 13:43:46 UTC]]